###  Quantitative analysis using pynance and TaLib

#### Load stock price data into a pandas DataFrame

In [1]:
import sys
sys.path.append('..') # let python look to modules in our parant folder

In [5]:
from src.load_data import load_data

tickers = ["AAPL", "AMZN", "META", "MSFT", "NVDA"] #list of ticker for dataset
all_data={}
# load all five datasets 
for t in tickers:
    df=load_data(t)
    all_data[t] = df

In [6]:
#see each of My data
all_data["AAPL"].head(5)

         Date     Close      High       Low      Open      Volume
0  2009-01-02  2.721686  2.730385  2.554037  2.575630   746015200
1  2009-01-05  2.836553  2.884539  2.780469  2.794266  1181608400
2  2009-01-06  2.789767  2.914229  2.770872  2.877641  1289310400
3  2009-01-07  2.729484  2.774170  2.706990  2.753477   753048800
4  2009-01-08  2.780169  2.793666  2.700393  2.712090   673500800

In [7]:
all_data["AMZN"].head(5)

         Date  Close    High     Low    Open     Volume
0  2009-01-02  2.718  2.7265  2.5535  2.5675  145928000
1  2009-01-05  2.703  2.7870  2.6515  2.7865  190196000
2  2009-01-06  2.868  2.9110  2.6875  2.7275  221602000
3  2009-01-07  2.810  2.8475  2.7675  2.8145  158854000
4  2009-01-08  2.858  2.8660  2.7290  2.7495  131558000